src/ToolsInternational/src/DataProcessors/УИ_КонструкторРегулярныхВыражений/УИ_КонструкторРегулярныхВыражений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УИ_КонструкторРегулярныхВыражений</name>
  <attributes>
    <name>Маска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Multiline</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Global</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IgnoreCase</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПодстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокВыбораМаски</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>SubMatches</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubMatchesIndex</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛеваяСкобкаПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПраваяСкобкаПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонИмениПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Форматирование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Варианты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тест</name>
      <comment>Текст отладочного теста</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Извлечь</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещатьСписок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзвлечьСписок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Форматирование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Варианты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/ToolsInternational/src/DataProcessors/УИ_КонструкторРегулярныхВыражений/Forms/ИмпортВыражений/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СписокПараметров = Параметры.СписокПараметров;
	Для Каждого Парам Из СписокПараметров Цикл
		Структура = Парам.Значение;

		Стр = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Структура);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровПриАктивизацииСтроки(Элемент)

	СписокВыбора = Элементы.ТаблицаПараметров.ПодчиненныеЭлементы.ТаблицаПараметровДействие.СписокВыбора;
	СписокВыбора.Очистить();

	ТД = Элементы.ТаблицаПараметров.ТекущиеДанные;
	Если ТД.НовыйПараметр Тогда
		СписокВыбора.Добавить("Сохранить новое значение.");
		СписокВыбора.Добавить("Не сохранять новое значение.");
	Иначе
		Если ТД.НовоеЗначениеПараметра = ТД.ПрежнееЗначениеПараметра Тогда
			СписокВыбора.Добавить("Они равны. Пропустить.");
		Иначе
			СписокВыбора.Добавить("Оставить прежнее значение.");
			СписокВыбора.Добавить("Сохранить новое значение.");
		КонецЕсли;
	КонецЕсли;

	СтрокаДляСравнения = ТД.НовоеЗначениеПараметра + Символы.ПС + ТД.ПрежнееЗначениеПараметра;
	УстановитьЦветФонаСтрокиДляСравнения();

КонецПроцедуры
&НаКлиенте
Процедура УстановитьЦветФонаСтрокиДляСравнения()

	ТД = Элементы.ТаблицаПараметров.ТекущиеДанные;
	Если ТД.НовыйПараметр Тогда
		Если ТД.Действие = "Сохранить новое значение." Тогда
			Элементы.СтрокаДляСравнения.ЦветФона = Новый Цвет(192, 220, 192);
		Иначе
			Элементы.СтрокаДляСравнения.ЦветФона = Новый Цвет(192, 192, 192);
		КонецЕсли;
	Иначе
		Если ТД.НовоеЗначениеПараметра = ТД.ПрежнееЗначениеПараметра Тогда
			Элементы.СтрокаДляСравнения.ЦветФона = Новый Цвет(255, 250, 205);
		Иначе
			Если ТД.Действие = "Сохранить новое значение." Тогда
				Элементы.СтрокаДляСравнения.ЦветФона = Новый Цвет(255, 192, 203);
			Иначе
				Элементы.СтрокаДляСравнения.ЦветФона = Новый Цвет(255, 228, 225);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ТаблицаПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТД = Элементы.ТаблицаПараметров.ТекущиеДанные;
	Действие = ТД.Действие;
	СписокВыбора = Элементы.ТаблицаПараметров.ПодчиненныеЭлементы.ТаблицаПараметровДействие.СписокВыбора;

	Индекс = СписокВыбора.Индекс(СписокВыбора.НайтиПоЗначению(Действие));
	Индекс = Индекс + 1;
	Если Индекс = СписокВыбора.Количество() Тогда
		Индекс = 0;
	КонецЕсли;

	ТД.Действие = СписокВыбора[Индекс].Значение;
	УстановитьЦветФонаСтрокиДляСравнения();
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)

	Закрыть(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)

	СписокПараметров = Новый СписокЗначений;
	Для Каждого Стр Из ТаблицаПараметров Цикл

		Структура = Новый Структура("Наименование,НовыйПараметр,НовоеЗначениеПараметра,ПрежнееЗначениеПараметра,Замещать,Извлечь,Действие");
		ЗаполнитьЗначенияСвойств(Структура, Стр);
		СписокПараметров.Добавить(Структура);

	КонецЦикла;

	Закрыть(СписокПараметров);

КонецПроцедуры
